[
{"title": "Microsoft deepens Teams ties with Dynamics 365", "img_url": "https://images.idgesg.net/images/article/2019/09/microsoft_teams_security_considerations_mobile_messaging_collaboration_tools_thinkstock_511733570_virtual_technology_focus_security_radar_circular_brackets_by_xresch_cc0_via_pixabay-100810566-large.jpg", "content": "Microsoft this week unveiled deeper integrations between Teams and  as the company moves to make it easier for sales and customer service staffers to communicate without switching between apps.  The company highlighted  at its  this week. Microsoft's goal: collect and tie together data in a way that makes it actionable — and easier to share among workers via Teams.“[W]hat stands out for me in this new wave of innovation we're doing together across Dynamics 365 and with [Microsoft] 365 is this need to connect systems of record with systems of engagement in order to create these new opportunities for business workflows that can really digitize the way companies work,” Emma Williams, corporate vice president of Microsoft Office Modern Workplace Transformation, said during a session at Ignite on Thursday.The closer ties between Teams and Dynamics 365 should have a significant impact for users of both apps, said Raul Castanon, a senior research analyst at 451 Research, part of S&P Global Market Intelligence. The integrations can enable a workflow-centric approach that reduces friction in day-to-day tasks and leads to improved efficiencies, he said.“Rather than users switching between business applications to get their work done, enabling collaboration features within ERP and CRM applications aligns more closely with business workflows,” said Castanon.“By Microsoft bringing Teams and Dynamics 365 closer together, distributed sales, service and marketing teams are able to collaborate far more efficiently,” said Kyle Davis, a Gartner Research vice president.For Dynamics 365 Sales, Teams chat can be embedded in the customer relationship management (CRM) app; sellers will also be able to continue one-to-one conversations with suggested colleagues working on a customer account and access team chats that mention the customer.The embedded chat is also available in the Customer Service and Field Service modules within Dynamics 365, allowing customer support agents to communicate on subject matter more effectively.Teams chats and channels are present in a side-panel display, alongside suggested chats and contacts based on colleagues working on a given account.Among the other additions to Dynamics Sales is a Teams call dialler that lets sellers contact customers without switching screens. The call panel will also display real-time transcriptions of conversations with business-critical phrases and suggested actions highlighted, and offers a note-taking tool connected to the sales records. After the call, a summary with follow-up actions and call sentiment analysis is then created. (A similar experience is enabled for Teams video calls setup by the salesperson.)There’s also a Dynamics Sales integration designed to make sales information more readily available in Teams, allowing users to search for and share customer records; they can then viewed and edited by colleagues in the collaboration app.The features are due to roll out next month, Microsoft said.There were new Teams integrations with Dynamics 365 Marketing, too, with users able to set up, analyze and follow up on events hosted in Teams.From here, marketers can decide whether to stream an event, choose which platform to use – including the new Teams Webinar function, also announced at Ignite - and select among options such as muting of attendee microphones or enabling post-event Q&As.From the Teams app, it is possible to follow up with participants, with the ability to export attendee information to Dynamics 365 Marketing to view customer segments based on audience attendance, and coordinate future communications.Microsoft also unveiled  with Dynamics 365's HR, Commerce, and Supply Chain Management apps.Integrating Teams into the workflow of business app users has been a growing priority for Microsoft. It  new ways to interact with SAP’s enterprise resource planning (ERP), HR, and CRM software from Teams. This will, for instance, enable SAP users to share information such as supplier details with colleagues without switching screens.Microsoft is not the only vendor, however, that's poised to combine collaboration capabilities with the systems of record that many workers use day-to-day.Salesforce’s  late last year allows Salesforce to integrate the popular team chat app into its own business software, including its widely used CRM platform.“This is not a Microsoft exclusive strategy,” said Davis. \"Salesforce recently acquired Slack, who is positioned to offer similar experiences within its ecosystem.“As these two major vendors in the CRM market are making similar moves, it solidifies the importance and demand for strong unified digital collaboration experiences across the processes and activities performed in CRM and the conversations in workstream collaboration tools,\" he said.While the timing of Microsoft’s integration announcements may seem like a reaction to Salesforce's acquisition of Slack, Castanon said the changes are the result of a platform-based approach Microsoft has been developing for several years; they reflect a larger trend towards communication-enabled workflows.“It also reflects that a platform-based approach can better address the requirements of several use cases — in this case, customer support — than a standalone communications tool,” he said.In a related announcement this week, , which will enable users to communicate with external clients and partners more easily via shared channels within Teams.The feature could prove useful to those in sales, marketing and customer support roles, in particular.   External collaboration for customer engagement is one of the key areas Microsoft could seek to tackle with shared channels — including customer support, sales and marketing, said Castanon.“The integration of Dynamics 365 with Teams, enhanced with the capabilities that Connect-shared channels enable, should allow organizations to streamline and build efficiencies in workflows for customer service representatives and support agents,” he said.", "link": "https://www.computerworld.com/article/3610392/microsoft-deepens-teams-ties-with-dynamics-365.html"},
{"title": "Apple on track for 3nm silicon iPhones and more in 2022", "img_url": "https://images.idgesg.net/images/article/2020/08/tsmc-wafer-image-100855531-large.jpg", "content": "iPhones, iPads, and Macs seem set for even steeper performance and power management gains come 2022, as it looks like the company’s plans to switch to 3-nanometer (nm) chips are falling into place.We’ve considered the , and those predictions seem to be on the right track for a late 2022 shift to chips manufactured . Chips manufactured with this process deliver 30% improvements in power consumption and 15% better performance in comparison with 5nm chips.Apple designs and develops processors in house and hires chip supplier TSMC to manufacture the majority of those it uses in its devices. TSMC is investing in 3nm processor production, and a  tells us the company is on track to begin early-risk production of chips based on that process in the second half of the year, with production of its existing 5nm chips expected to increase quite dramatically in the second half of 2021.(The latter makes sense, given the majority of Macs and all iPhones and iPads Apple sells will use those chips by that time.)Macs using M1 chips currently have eight cores, with that number expected  and 32 cores in high-end Macs . Is it possible those 32-core chips will be manufactured using 3nm process technology?Apple has promised to complete its transition to Apple Silicon in Macs by around 2022.Most  should note that the emerging road map suggests high-end Macs may be on track to outclass high-end PCs in terms of performance, even as Apple continues to consume a greater slice of global component and processor production.The effect of growing global demand for processors was most recently made visible in the car industry, when Volkswagen, Ford, Fiat Chrysler, Subaru, General Motors, Honda, Renault, and Toyota were all   of new vehicles due to short chip supplies. (It is unclear whether demand for components used in Apple’s products contributed to the problem.)It's important to control the means of production, and while Apple doesn’t precisely own the factories, it is a huge client for those who do. When it comes to chips, Apple is TSMC’s biggest client — taking most of the chips the company manufactures. And we’ve previously learned it has already . This puts wind behind the sails of Apple’s migration to , and means Macs, iPhones, and iPads will continue to lead the industry in terms of performance per watt.Apple’s previous Mac processor supplier, Intel, is not expected to introduce chips based on a 3nm process .The M1 chips are already impressive and . But Macs and other devices powered by chips built on 3nm process tech will deliver even more compelling power and performance advantages as they appear, likely .With a view to other aspects of Apple product development, the iPhone maker is working with TSMC on ultra-advanced display technology using micro OLED displays for use in future devices,  has claimed.The two partners are also working on micro LED tech, with trial production lines for both already in place. That work is allegedly being led by veterans hired from AU Optoelectronics.  for use in future devices, with these also expected to debut around 2022-2023, and  its GPU technologies for Macs.What comes next? We know . But the cost of that work means many are trying what Apple already does, striving to develop advanced SoC processors, working with new transistors, materials, and lithographic processes at an increasingly tiny, molecular, and sub-molecular scale.In other words, another tangent to Apple’s processor development future will arrive in the form of advanced microprocessor architectures. That means we’ll be hearing keynote buzzwords and statistics such as transistor counts and operations per second designed to show how Apple’s devices deliver advantages at a molecular and sub-molecular level.After all, at some point there will be little advantage to be gained from smaller die sizes, which is when focus will turn to further optimizations at that scale. Apple appears to be in the cat bird seat from which its next decade of processor production and development seems clear across all its platforms.And that’s even before considering the kind of processor power, speed, and built-in neural engines we’ll need to safely handle the millions of data points required for safe and autonomous control of any Apple Car.", "link": "https://www.computerworld.com/article/3609778/apple-on-track-for-3nm-silicon-iphones-and-more-in-2022.html"},
{"title": "Podcast: 30K Macs infected with \"Silver Sparrow\" virus; M1 Mac SSD health", "img_url": null, "content": "Security researchers uncovered malware affecting tens of thousands of macOS devices, but it's unclear what exactly the malware does. Affecting both Intel and Apple Silicon processors, this malware, nicknamed \"Silver Sparrow,\" still poses a threat. And in other Apple news, some M1 Mac users have reported that the SSDs on their new systems are being overused. Macworld executive editor Michael Simon and Computerworld executive editor Ken Mingis join Juliet to discuss Apple's response to the virus and SSD issues and what users can do if they've been affected.", "link": "https://www.computerworld.com/article/3609611/30k-macs-infected-with-silver-sparrow-virus-m1-mac-ssd-health.html"},
{"title": "Google matches Mozilla, reduces time between Chrome upgrades to four weeks", "img_url": "https://images.idgesg.net/images/article/2018/07/chrome_browser_logos_by_gerd_altmann_cc0_via_pixabay_1200x800-100765584-large.jpg", "content": "Google plans to accelerate Chrome's release schedule to match rival Firefox's every-four-week cadence.The Mountain View, Calif. company will also offer a new release channel, dubbed \"Extended Stable,\" that will be refreshed every eight weeks, aimed at enterprises weary of frequent deployments.\"As we have improved our testing and release processes for Chrome and deployed bi-weekly security updates to improve our patch gap, it became clear that we could shorten our release cycle and deliver new features more quickly,\" Alex Mineer, technical program manager, Chrome operations, wrote in a .Goggle's reasoning for the new tempo was identical to Mozilla's rationale for . Then, two Mozilla officials cited the same more-stuff-faster grounds. \"We're adjusting our cadence to increase our agility, and bring you new features more quickly,\" said , the Firefox release management team leader and senior director of product integrity, respectively.The switch to a swifter release cadence won't happen overnight. Instead, Google will start the four-week interval in the September quarter, with Chrome 94. (For context, Google issued Chrome 89 last week.)In the near term, Google will continue to upgrade Chrome every six to eight weeks. Chrome 90, for instance, is to launch April 13 (six weeks after version 89), Chrome 91 on May 25 (six weeks), Chrome 92 on July 20 (eight weeks), and Chrome 93 on Aug. 31 (six weeks).At that point, things get a bit weird, as Google will pause only three weeks between Chrome 93 and 94; the latter is to launch Sept. 21. Between Chrome 94 and 95, though, there will be the new four-week standard, with the latter releasing on Oct. 19.As well as the faster release tempo for Chrome, Google also decided to mimic Mozilla in another way: It will offer a less-frequently-upgraded version, called \"Extended Stable,\" for enterprises and other large organizations, just as Mozilla provides a Firefox \"Extended Support Release,\" or ESR.Unlike Firefox ESR — which remains the same, feature- and functionality-wise, for more than a year — Chrome Extended Stable stays static for just eight weeks. Google will update Extended Stable every two weeks with security fixes, but only those which address \"important\" issues. Mineer did not elaborate or define \"important,\" but said: \"Those updates won't contain new features or  that the four-week option will receive [].\"Only customers using group policies will be able to enable and run Chrome Extended Stable.Like Chrome, Microsoft's Edge browser also relies on the Google-dominated open-source Chromium project for its underpinnings, including the core technologies that render pages and run scripts. With Chromium's build schedule changing to speed up Chrome's releases, Edge will have to follow suit.Microsoft has yet to confirm that; in fact, its  goes only as far as version 93, the version before the intervals begin shrinking.More information about Chrome's release cycle can be .", "link": "https://www.computerworld.com/article/3610705/google-matches-mozilla-reduces-time-between-chrome-upgrades-to-four-weeks.html"},
{"title": "HSBC now offers Mac-friendly choice scheme", "img_url": "https://images.idgesg.net/images/article/2019/08/180502-hsbc-logo-london-1-high-res-100807070-large.jpg", "content": "One of the world’s largest banking and financial services organizations, , last year introduced an employee-choice program enabling its workforce to choose to use a Mac as their primary work computer.Back in 2008, HSBC was among the first major businesses to  and . More recently, it  to  as it freed employees to  during the pandemic.It’s the latest example of increasing adoption of Apple’s hardware within , which has helped the company seize a . briefly during a recent analyst call. It explained how HSBC worked with Jamf and Apple to enable the program, introducing Zero Touch configuration and deployment so employees could easily , enabling them to be , mitigating some of the endpoint risk associated with work from home (WFH).“This process allowed HSBC to efficiently upgrade devices for employees working from home and reduce deployment costs,” said Jamf CEO Dean Hager.He noted that the scale of the  posed an additional challenge at the time:HSBC has 232,957 employees worldwide, and while it isn’t known how many will now be using Macs (I have asked for more information), this is still likely to be a significant deployment of the platform.He also noted that while other PC manufacturers had problems meeting demand for WFH computers, Apple was able to maintain supply. That’s particularly impressive given the  that have beset the industry across the last year, and the huge scale of demand across enterprises for new Macs. (Don’t forget that one of the first pandemic resilience acts engaged in by Starling Bank was to acquire all available MacBooks to equip staff as they moved to work remotely.)Hager believes that Apple’s introduction of M-series processors in the newest Macs will accelerate the trend of enterprise adoption, noting that demand for these among employees at companies supporting them is already strong. “We see the new Mac increasing demand,” said Hager.Of course, remote working also poses security problems, which has seen some companies fail to migrate to non-kext app development for their anti-malware apps for M1 Macs.“Remote work, we believe, actually created a greater demand for security solutions as well as those people working from those homes, all the more important to make sure that they are protected from threats,” said Hager.There’s a growing belief that working remotely will form part of the new normal once we emerge from the pandemic. HSBC certainly seems to agree. Not only has the company started its employee-focused tech choice scheme, but company COO John Hinshaw closed 2020 when he said the bank will use .Jamf is thinking along the same lines. “What we have told our employees is going forward we will continue to have facilities, and we will continue to have offices that employees will come in to work at, and we want to create a great environment where they want to come into work,” said Hager.“However, our facilities will no longer be an expectation of our employees. It will be a service that we provide them.”The desire to avoid unnecessary contact during the pandemic also seems to be driving , HSBC has said. The company  in June 2020 when it introduced support for Apple Business Chat, with similar experiences seen across all such services. Just look at  and how they grew across the last 12 months.“We’ve been on a multi-year effort in the enterprise and have gained quite a bit of traction there,” . “We’re very optimistic about what we can do in that space.”Hager seems to agree. He told analysts: “When you come off a year where you've had more employees working at home than any time in our history, we believe that will do nothing but fuel the consumerization of IT.”", "link": "https://www.computerworld.com/article/3610689/hsbc-now-offers-mac-friendly-choice-scheme.html"},
{"title": "Google Workspace targets front-line workers with new tier", "img_url": "https://images.idgesg.net/images/article/2020/10/screen-shot-2020-10-06-at-12.55.33-pm-100860966-large.jpg", "content": "Google has introduced a Workspace tier for front-line jobs such as retail, hospitality, and healthcare workers. The company today also unveiled new features around time management and productivity-tracking for the core Workspace —  — software. The Workspace Frontline edition includes all of the standard Workspace apps such as Gmail, Calendar, and Chat, as well as advanced endpoint management to secure employee mobile devices.   “We've also made it easier for business teams to build custom AppSheet apps directly from Google Sheets and Drive so that frontline workers can digitize and streamline their work, whether it's collecting data in the field, reporting safety risks, or managing customer requests,” Javier Soltero, vice president and general manager of Google Workspace, .The new tier will be available in all of the countries where Workspace is currently sold and is due to launch in early April.Pricing for the new tier was not immediately available; a Google spokesperson promised Google Workspace Frontline edition pricing would be shared in “the coming weeks.” (Computerworld also asked for additional details on features of the Frontline Worker edition but did not immediately receive comment.)Google already offers access to its app suite alongside features such as advanced endpoint management in its Business Plus tier ($18 per user each month), as well as Business Starter ($6 per month), and Business Standard ($12 month) with access to fewer features and certain restrictions on usage.Front-line workers have typically been overlooked when it comes to getting access to digital tools. However, that lack of attention has been shifting as the importance of front-line roles has grown during the pandemic.“With the growth in remote work during the pandemic, there’s been a recognition of how critical these roles are, and many businesses are now realizing they need to better connect these workers to the broader organisation — especially as their office workers are no longer in the corporate office,” said Angela Ashenden, a principal analyst at CCS Insight.  Google is not the first productivity software vendor to target tools toward use by front-line workers. Microsoft has two Microsoft 365 add-ons for this purpose; Microsoft 365 F1 and F3, which cost $2.25 and $8 per user each month, respectively. Microsoft has also developed  that are  .Similarly, Facebook  for its Workplace app in 2019 that caters to these roles.“We’re seeing IT organizations looking to take a more holistic approach to how they support their employees, wherever they are based, and there’s a scramble among tech providers to be the go-to solution for this group,” Ashenden said. “To a large extent, Google is playing catch up with this targeted offering, although it has had success with enabling this group of workers through its existing licences. Ashenden added that while Google has yet to fill out the full details of the Frontline Worker edition, it’s likely to be a cut-down version of Workspace focusing on central communication features alongside Workspace security and management.Google also announced a new set of features for Workspace to help employees manage their working lives. This includes “segmentable working hours” to let users designate to colleagues when they are online and available for meetings; recurring out-of-office events; a “focus time” feature that limits notifications during certain periods; and location indicators that share the days an employee is working from home.There’s also a “time insights” feature that offers workers metrics on how they are spending their time, such as hours spent on focus time, time in meetings, and out of the office. Google said the information is viewable by employees only, not their managers.", "link": "https://www.computerworld.com/article/3609839/google-workspace-targets-front-line-workers-with-new-tier.html"},
{"title": "What's in the latest Firefox upgrade? Proliferating picture-in-picture, even more anti-tracking", "img_url": "https://images.idgesg.net/images/article/2021/01/mozilla_firefox_logo_against_abstract_blue_orange_smoke_by_lucas_benjamin_cc0-like_via_unsplash_2400x1600-100873427-large.jpg", "content": "Mozilla last week raised the Firefox version count to 86, adding multiple picture-in-picture video viewing and bolstering the browser's anti-tracking defenses by isolating  cookies in the sites that create them.Security engineers also , five of which were pegged as \"High,\" Firefox's second-most-serious label.Firefox 86 can be downloaded for Windows, macOS and Linux from . Because Firefox updates in the background, most users can just relaunch the browser to get the latest version. To manually update on Windows, pull up the menu under the three horizontal bars at the upper right, then click the help icon (the question mark within a circle). Choose \"About Firefox.\" (On macOS, \"About Firefox\" can be found under the \"Firefox\" menu.) The resulting page or pop-up shows that the browser is either up to date or displays the refresh process.Mozilla upgrades Firefox every four weeks; the last refresh was on Jan. 26.Firefox's picture-in-picture mode debuted early in 2020 in Firefox 72 (some got the feature at the end of 2019, in Firefox 71), letting users deposit a frame on the desktop, video inside, from most — but not all — in-tab videos. The frame could be moved and resized at will, and was independent of the tab.Firefox 86 offers the same, but in spades: Users can crank out several frames, each showing a different video, each able to be positioned anywhere on the desktop. As long as the originating tab remains open, the video will continue playing.Applications of this may be tougher to come up with than one might think, but multiple frames would be great for following several networks' coverage of a major event, say with the audio off on all but one, or for watching — or just keeping track of — several play-off games simultaneously.The other addition to Firefox 86 that  was what it called \"Total Cookie Protection.\"\"Total Cookie Protection confines cookies to the site where they were created, which prevents tracking companies from using these cookies to track your browsing from site to site,\" wrote Tim Huang, Johann Hofmann and Arthur Edelstein — senior software engineering, Firefox developer and senior product manager respectively — in a  to a company blog.\u2028The last upgrade before this — January's Firefox 85 — locked up so-called \"supercookies,\" identifiers that actually  cookies but trackers based on sometimes-obscure elements in a browser, such as . Firefox 86 expanded on its predecessor's efforts by siloing  cookies.(Together, the previous supercookie isolation and the newer, more inclusive cookie quarantining, said Mozilla, block sites \"from being able to 'tag' your browser, thereby eliminating the most pervasive cross-site tracking technique.\"The feature wasn't enabled by default in Firefox 86. Instead, users must steer to Preferences' \"Privacy & Security\" section and select the  option under \"Enhanced Tracking Protection.\"More technical information about Total Cookie Protection can be found on  and on the .Elsewhere, Mozilla said that Firefox 86 cleaned up the design of the browser's Print interface.The next version, Firefox 87, will be released March 23.", "link": "https://www.computerworld.com/article/3251749/whats-in-the-latest-firefox-upgrade-proliferating-picture-in-picture-even-more-anti-tracking.html"},
{"title": "Microsoft’s Mesh aims for mixed-reality meetings of the future", "img_url": "https://images.idgesg.net/images/article/2021/03/microsoft-mesh-physical-objects-100879311-large.jpg", "content": "Microsoft offered a glimpse of what it believes will be the future of remote collaboration at Ignite on Tuesday, with workers one day able to interact with holographic items and talk to photo-realistic, life-like “holoportation” avatars of their colleagues.The vision is based on the potential of Microsoft Mesh, a new Azure-based developer SDK that enables the creation of collaborative mixed-reality apps that can be used across multiple devices.Microsoft hopes that Mesh will boost the ecosystem of mixed-reality development, abstracting some of the technical problems involved in the creation of virtual environments. Collaborative apps can then be delivered across any platform, whether it be Microsoft’s own $3,500 HoloLens 2 headsets or those from competitors such as Oculus, as well as on regular laptops or smartphones.Speaking during the company's  this week, Microsoft CEO Satya Nadella compared Mesh to “what Xbox Live did for gaming.“We went from single player to multiple player, creating communities that helped people connect and achieve together,” he said. “Now, just imagine if the same thing happened with mixed reality. Mesh enables you to interact holographically with others with true presence in a natural way.”The prospect of workers attending team meetings via 3D photo-realistic “holoportation” is , and is not publicly available. What is ready for use is a Mesh app for HoloLens. This allows multiple colleagues to join remote collaboration “spaces” using Microsoft’s headset with more simplistic, animated avatars representing meeting participants. Users can then annotate, draw and import 2D and 3D content from OneDrive into the shared virtual environment.As with all Mesh-based apps, it integrates with Azure Active Directory and Microsoft Account MSA identity services for user authentication, and information is encrypted.The Mesh app for HoloLens 2 is .In addition, Microsoft promises a , the social VR platform acquired by the company in 2017. This will offer “enterprise-ready collaborative events” in full VR, such as meetings, town halls and other gatherings, while those without VR headsets can join on their laptop or PC in 2D-mode.Access to the app is available upon request.Wayne Kurtzman, a research director at IDC, sees potential for Mesh to create new types of digital experiences for workers. “As teams become more geographically dispersed, AR/MR products like Microsoft Mesh will make meetings more interactive, add new forms of value, and provide new ways of truly connecting each other,” he said.Microsoft is not the first to provide 3D virtual collaboration environments, with companies such as Spatial offering experiences similar to what can be done now with Mesh and HoloLens devices.However, Microsoft could pave the way for wider use of virtual environments for collaboration, said Anshel Sag, an analyst at Moor Insights & Strategy, by building on early interest in the technology for connecting workers.Microsoft said more apps are on the way, whether developed in-house — Teams and Dynamics365 are  — or from third-party developers.“Mesh is without a doubt a future-looking peek at meetings and remote collaboration, but as more of the leading tech companies embrace spatial computing, we will see an increased uptake of XR [extended reality] for work,” he said.Going forward, Sag sees the potential of other new ways of interacting with Microsoft’s portfolio of productivity products.“Nobody wants to build a collaboration tool within their own apps from scratch and I would really like to see Microsoft leveraging Mesh inside of its own productivity apps as a way to show the best practices and implementations of the platform's capabilities,” said Sag.Such tools would need to improve on the 2D experiences currently available, he said. “For example, I would love to see someone presenting their slides in person in XR rather than just talking through them one by one and hitting the slide advance button,” he said.“We know that Microsoft is starting with AltspaceVR, but I believe the potential is quite great when you consider the breadth of Microsoft.” ", "link": "https://www.computerworld.com/article/3610236/microsofts-mesh-aims-for-mixed-reality-meetings-of-the-future.html"},
{"title": "Enterprise collaboration enters the innovation fast lane", "img_url": "https://images.idgesg.net/images/article/2020/10/onzoom-discovery-page-laptop-100862188-large.jpg", "content": "While most enterprise meetings are more sedate than those at , collaboration tools are evolving rapidly, driven by the global work-from-home (WFH) surge and in the use of Zoom, which now claims 467,100 customers and saw revenues climb 326% year-on-year on the strength of the move to remote work in 2020.Most recently, we’ve seen collaboration software merchants focus on translation, transcription, and partnership as they stake out space in what many expect will be more remote-friendly future working practices.More enterprise-focused collaboration tools, such as , are also achieving a wider profile as thoughts turn to a future hybrid workplace. Here are a few iterative improvements that have emerged in recent weeks in this arena.One of Apple’s most widely used business communication tools, , now boasts  as the battle for video collaboration services continues to intensify. It means users will be able to preview real-time translations from English into those languages from within Webex. The translations are provided by artificial intelligence.The company says it hopes the new feature will help improve international collaboration within teams, and plans to introduce immersive sharing of content in meetings later this year.Perhaps one of the most useful apps around,  can now record and transcribe meetings from within Google Meet and Zoom. It will also deliver live video captioning during Zoom Pro calls. The feature is seen as an accessibility tool, but has obvious use when meeting participants want to clarify statements or for putting original transcripts together from which to build meeting minutes and other tasks.It’s a great tool for interview transcriptions, and works online, with iOS, and Androidt.Microsoft continues to iterate and improve Teams. It recently announced plans to add end-to-end encryption to the service — it’s a shame it didn’t have this already, given that so many government departments make use of the software. Teams is also gaining a new feature that allows it to identify up to 10 speakers during a call, which it uses to identify who is talking as it transcribes the call.Microsoft also recently improved support for  from within the application, enabling remote team members to participate in chats more easily when they're out of bandwidth range.Zoom is adding closed captions for all free accounts later this year, though free users can now request the update by filling in a form on the company site. It has been a feature only available through paid accounts (thanks to Otter.ai) until recently.The company in February also introduced , a product designed to help businesses support employees returning to the office and to provide hybrid present/remote meeting experiences.Google has  aimed at front-line workers, such as those in retail, hospitality, and healthcare. Workspace Frontline takes the apps you’re used to from Google and adds  some endpoint management tools to help keep remote devices secure.Workspace supplements apps such as Calendar or Gmail with a range of useful time and task management, location, and communication tools and is seen as the search advertising giant’s attempt to become relevant to the enterprise.Zoom’s move to support hybrid working environments is shrewd, as some nations attempt (perhaps too soon) to return to something like normal. Most businesses will likely retain support for remote working for some time yet, if only to protect business continuity in the event of an outbreak. A PwC study of 1,200 U.S. office workers found the majority now want to work remotely .As offices themselves change to support different working models, shared spaces, on-demand meeting rooms and the need for technologies to manage them — along with tools to support hybrid remote/present meetings — will grow.  now recommends future team meetings be conducted as if every participant is remote, even if some are in the conference room.In terms of collaboration software, tools for  that capture productivity, such as , , , and even , seem to be in demand.Of course, as adoption of Macs, iPhones, and iPads across the enterprise , the days of Apple being a second-class citizen in the  will continue to erode, bringing new opportunity for iOS and macOS enterprise-focused developers to build essential tools for the remote-work-friendly future of business.It's a shame  and  now seem highly unlikely to gain the improvements they’ll need to be an integral part of any such ride.", "link": "https://www.computerworld.com/article/3609603/enterprise-collaboration-enters-the-innovation-fast-lane.html"},
{"title": "Cisco continues to overhaul Webex, now with real-time language transcription", "img_url": "https://images.idgesg.net/images/article/2020/12/in-meeting-reaction-hand-gesture-100870294-large.jpg", "content": "Having announced more than 50 planned innovations at its WebexOne event in December, Cisco’s Webex is rolling out another of those capabilities today: real-time language translation. The feature will be available in Webex as a preview starting this month, with general availability in May.Users of the platform will soon be able to have their in-meeting speech translated in real time from an expanded library of over 100 languages, including Maori, Zulu and Armenian. The plethora of new languages underlines Cisco’s aim to “power an inclusive future for all.” The feature was initially unveiled with only nine perspective languages in the works.Jeetu Patel, senior vice president and general manager of security and applications, said Cisco has made “north of a billion dollars” worth of investments in AI, including the  in 2019, a company specializing in meeting transcription, voice search, and meeting action items. Without providing specifics, Patel claimed that accuracy rates with real-time transcription are “starting to get exciting.” on intelligent virtual assistants found that nearly 24% of participants have meetings that include non-English native speakers, and of these, more than half have been using third-party services to translate meetings, costing an average of $172 per meeting.\"The inclusive features of Webex help create a level playing field for users, regardless of factors like language or geography,” Patel said in a statement. “Enabling global real-time translations is another step toward powering an Inclusive Future, and an important component of driving better communication and collaboration across teams.\"Today’s launch continues to build on the goal Webex set last year when it unveiled a variety of changes and updates to Webex: “Deliver a Webex experience that is 10x better than in-person [interactions].”The features unveiled at the virtual event fell into three over-arching categories — seamless collaboration, smart hybrid work, and intelligent customer experiences —are designed to address the needs of a rapidly evolving workplace and better position the company against rivals.“Webex enables a shift towards hybrid working and less reliance on geography-based hiring, opening the global economy and giving everyone a seat at the table — no matter where the table is,\" said Patel during a keynote speech at .Patel argued in December that many of the new features on Webex aren’t available on competitors’ platforms. Among the changes and new features unveiled then:While some features were available immediately, most will arrive this year — including an option for bigger meetings. With Webex Events native live streaming, users will be able to host up to 100,000 active participants.Zeus Kerravala, founder and principal analyst at ZK Research, was bullish on the changes when they were announced. “The noise cancellation and speech enhancements greatly improve meetings, not just at home but in the office,\" Kerravala said. \"Everyone has been in the meeting with the loud typist in an office, the person eating chips or the mower going at the person's home when they are working from home. Noise cancellation lets people work almost anywhere and not disrupt the meetings.”He also praised the customizable layouts and the gesture recognition as smart additions, saying they should help drive greater meeting interactions and contributions.Seperately, the company late last year made changes designed to position the platform as more of a direct competitor to Slack, Microsoft Teams and Google Meet. Users of the new Webex will be able to call, meet and message in one app via Webex Teams.Bringing Webex Meetings and Teams together was “long overdue,” Kerravala said. “Cisco has long talked about maintaining continuous collaboration, and this is a big step in doing that.\"Along with the new messaging capabilities, Cisco added AI features to Webex that allow it to learn what projects, spaces and people are most important, and then elevate them for better visibility. Those features arose from the acquisitions of Voicea, BabbleLabs and Accompany; Cisco said it has spent more $1 billion on AI technology to underpin its Webex Assistant and Webex Graph software.Webex Calling will get new calling plans and call-routing features such as video-on-hold and interactive voice response; that makes it easier to escalate voice calls to video meetings, the company said. And  users will get Webex message pinning, along with the ability to automatically send recorded meetings to specified groups and individuals.In other December announcements, the company touted contact center improvements, a strengthened partner ecosystem and three new hardware devices.For contact centers, Cisco expanded its platform to support businesses of all sizes, meaning the system can field customer service requests to thousands of virtual agents. It also rolled out a new microservices architecture to enable greater customization, and incorporating text and social channels. As for the company's app ecosystem, Cisco said its new App Hub would make integrations with third-party services more unified. The hub allows meeting participants to find and use integrations with services such as Box, Dropbox, Salesforce, ServiceNow and Workplace from Facebook.“Regardless of the application someone is using, they can work seamlessly with Webex,” Patel said.In terms of hardware, Cisco unveiled a new Webex Desk Camera, Webex Desk Hub and Webex Desk. Though Zoom and Microsoft have also released videoconferencing and communication hardware, with Zoom for Home and Duo, respectively, neither saw much uptake in 2020. Still, Kerravala said hardware is an important part of communication.“Cisco still has the largest install base, which is why they haven’t seen the same kind of growth [as other videoconferencing vendors],\" he said. \"However, they did take a backseat [in 2020] to a few other vendors as consumers flocked to Zoom and others. I think these features can help Cisco catch up and pass the field as it changes the way we think about meetings.\"", "link": "https://www.computerworld.com/article/3600648/cisco-continues-to-overhaul-webex-now-with-real-time-language-transcription.html"},
{"title": "Apple-friendly debugger helps make apps and websites accessible", "img_url": "https://images.idgesg.net/images/article/2020/08/ios14-accessibility-100855118-large.jpg", "content": "With millions still sheltering from the COVID-19 threat, there never has been a more important time to ensure mobile apps, websites, and web apps are accessible — and a new solution from Evinced hopes to empower developers to achieve that.When it comes to accessibility, the  (WHO) says there are more than 1 billion people worldwide living with some form of disability. That statistic alone should reinforce how important it has been that mobile apps and websites are built to be accessible, particularly during the COVID-19 pandemic.The problem is that perhaps 70% of mobile apps in some key categories have accessibility problems, some of which (such as support for pointing devices) may not be so easy to catch. (A Deque report claims  in March/April 2020 said COVID-19 increased the awareness and impact of accessibility on digital channels.) is a free Xcode-compatible debugging tool aimed at enterprise IT developers and designed to help identify accessibility problems within apps, websites, and web apps.Evinced is implemented during the software development process and provides those building the code with alerts at different stages of that process.Unlike most code-first checking tools, Evinced uses artificial intelligence to analyze both the inherent code as well as the user interface. In the event a coding problem is identified, the solution is smart enough to suggest ways to resolve it, leaving developers in control.This short video gives some sense of what it does.In a case study,  how it () has prioritized digital accessibility for years.It found it required a testing solution suitable to meet the challenges of our current world of dynamic, JavaScript-heavy web and mobile apps as well as websites. Existing website accessibilit- checking tools aren’t necessarily good at analyzing apps, which is why Capital One worked with Evinced.The bank also wanted a solution that could accelerate the journey from development to product release. Capital One claims Evinced helped identify 10 times as many accessibility issues as were found using its previous testing methods — in a fraction of the time (hours, not days). These included keyboard and screen reader issues.Evinced  in a round co-led by BGV and Capital One Ventures.There are plenty of reasons enterprise developers should prioritize accessibility in their apps. Not only is doing so , but accessible websites gain , which usually equates to more customer loyalty and revenue. The same logic applies to web and mobile apps. There’s also the  will form part of the foundations for future voice-first and gesture-based computing models as these emerge and evolve across the next few years.Consider , in which local results are presented — even the smallest business needs to ensure it scores as highly as possible when it comes to such searches; accessibility may help with this.", "link": "https://www.computerworld.com/article/3610333/apple-friendly-debugger-helps-make-apps-and-websites-accessible.html"},
{"title": "Tech event calendar 2021: Upcoming US shows, conferences, and IT expos", "img_url": "https://images.idgesg.net/images/article/2020/09/calendar_pages_flipping_through_months_time_schedules_past_future_history_whats_next_by_microstockhub_gettyimages-902635032_2400x1600-100859562-large.jpg", "content": "Computerworld has compiled a list of upcoming technology events for the IT industry taking place in the following weeks and months.With the COVID-19 pandemic, in-person conferences and summits may be rescheduled or canceled unexpectedly, so be sure to verify an event’s status before scheduling travel.This list will be updated as we hear of more events, so keep checking for updates.", "link": "https://www.computerworld.com/article/3313417/tech-event-calendar-shows-conferences-and-it-expos-updated.html"},
{"title": "Microsoft adds shared channels with Teams Connect", "img_url": "https://images.idgesg.net/images/article/2021/03/screen-shot-2021-03-03-at-2.18.23-pm-100879469-large.jpg", "content": "With the launch of Teams Connect at this week’s Ignite conference, Microsoft Teams users can now collaborate with external partners and clients in shared channels.Available in private preview ahead of a full roll-out later this year, Teams Connect shared channels are accessible within the main Teams app view alongside regular channels. Users can continue to access Teams features such as text chat, video and voice within shared channels, as well as share content and co-author documents with external users in real-time.When launched, Shared channels will appear as an option from the channel creation menu alongside standard and private channels. External Teams users can then be invited to join the shared space. \"[You'll] have this ability to have a shared channel with customers and with partners outside your company, where you can meet, you can chat, you can collaborate, you can co-author documents,\" Emma Williams, corporate vice president of Microsoft Office Modern Workplace Transformation, said during an Ignite session Thursday. \"We think [the] new sharing channel experience will be incredibly powerful for our customers.\"Teams admins will be given “granular controls” over external user access to data and information. This includes the ability to create policies that specify which users can create a shared channel, as well as which internal users can be added to a shared channel created by another organization.It will also be possible to allow or block sharing for an entire organization.Microsoft did not immediately offer details on the number of organizations that can access a shared channel, though the plan is to enable collaboration across as many organizations as needed. The company said additional details would be provided closer to the full feature launch.Shared channels is a long-awaited feature in Teams, said Wayne Kurtzman, a research director at IDC, and will help it compete with Slack and Google Chat in the team collaboration software market.“The ability to easily collaborate between companies using Shared Channels was something that Microsoft Teams was sorely missing,” said Kurtzman. “Teams Connect helps solve that problem by extending Teams membership to partner companies.”The announcement follows a similar move last year by Teams’ rival Slack. Slack Connect allows up to 20 organizations to collaborate in a single shared channel, an extension of the existing shared channel capability introduced by the vendor in 2017.“Teams Connect, like Slack Connect, meets a growing market need for cross-company collaboration, in context, integrating messaging, meetings, apps, and data,” said Irwin Lazar president and principal analyst at Metrigy, in a .Lazar also pointed out that, as with Slack Connect, Teams Connect only supports “like-to-like federation” between Teams users.   “Those wishing to federate their Microsoft Teams instances with other team collaboration apps, such as Cisco Webex and Slack have other options,” he wrote. “They can use third-party federation services, including Mio and Sameroom. Or they can consider allowing guest access to team spaces in conjunction with deploying security solutions from Safeguard Cyber, Theta Lake, or Unify Square to minimize guest account risk.”", "link": "https://www.computerworld.com/article/3610370/microsoft-adds-shared-channels-with-teams-connect.html"},
{"title": "Android 11 Upgrade Report Card: Well, this is awkward", "img_url": "https://images.idgesg.net/images/article/2021/02/android-upgrade-report-card-100876586-large.jpg", "content": "I've been closely monitoring how different Android device-makers do with post-sales software support for something like 97 years now, I think — and every year around this time, I brace myself for a brutal discovery.Here's the thing: Six months after a major operating system's release, most phones should be running that current software. I feel like that's a pretty obvious-seeming and uncontroversial statement to make.And yet, every year around this time, I start crunching the numbers (and also crunching some crackers, as all that number-crunching can really make a fella famished) — and you know what I find? Almost inevitably, a shockingly large portion of the top-tier, top-dollar Android phones in the land are either still stuck on 18-month-old software or just recently got the update they  have gotten six months earlier.The last couple cycles, at least, we saw  manner of  and  with Android upgrade delivery times, even if the overall results were still pretty dismal. So I had hoped that this year would continue that general trajectory and show us at a minimum some more modest change in the right direction.Um, yeah — so much for that.If there's one trend that shines through the data this year, it's the same one we've seen pretty consistently over time: Android device-makers, on the whole, just aren't very good at getting out software updates in a reasonably timely and reliable manner — even when it comes to their highest-paying customers. Companies can try to  any way they want, but data doesn't lie. And this year's numbers speak volumes.Now that we're six full months past the launch of , it's time to step back and look at who's making upgrades a priority and who's treating 'em as an afterthought. Get ready for some data-driven wake-up calls.The one bit of unambiguously good news with this year's Android upgrade cycle is also probably the least surprising. Google does a consistently commendable job of getting current Android software into the hands of the people who purchase its self-made Pixel products, with near-instant rollouts for all current devices and no real cause for complaint.That hasn't  been the case, entirely. This is actually just the third year that Google has received a 100% score in this analysis. Up until the Android 9 rollout, in 2018, the company had always either faltered slightly with its previous-gen flagship rollout or had some points docked for leaving certain models of its phones hanging longer than others and then failing to communicate anything about their progress.With Android 11, though, it's a completely clean slate and a shining example of how Android upgrades to be handled. Google announced Android 11, following its seven-month development preview period, and then started rolling the software out to its then-current-gen Pixel 4 flagship and its then-previous-gen Pixel 3 model — along with its three-year-old Pixel 2 phone and all of its midrange Pixel \"a\" devices, no less — on the very same day.(For the purposes of this analysis, by the way, it's the of a rollout — to a flagship phone model in the U.S. — that counts, as you can .)And while Google's usual \"rolling out in waves\" asterisk applied to a certain degree, with some Pixel owners not receiving the software on that  first day, Android 11 made its way to all supported Pixel devices within a reasonable amount of time and without the need for any extra communication beyond the company's initial announcement. And sure, we could argue that Google has a unique advantage in that it's both the manufacturer of the devices and the maker of the software — but guess what? That's part of the Pixel package. And as a person purchasing a phone, the only thing that really matters is the experience you receive.As usual, the results tell you all there is to know: Google's phones are without question the most reliable way to receive ongoing updates in a timely manner on Android. It's the only company that makes an overt guarantee about that, and it's absolutely the only one that delivers on it.We hear a lot of buzz about how Samsung is absolutely  it with upgrades as of late. And you know what? To the company's credit, it  been doing better than usual — relative to its own past performance. Heck, it's even in second place this year, though that says more about the rest of the ecosystem than about Samsung itself. But when you  with a standard, consistent scale, you see that Sammy isn't exactly knocking it out of the park.This year, in fact, Samsung did about the same as what it managed last year — with some very slight improvements in delivery times but not enough to move the needle on its overall score. (Since Samsung has thus far treated its Galaxy S and Galaxy Note phones as co-flagships, incidentally, I look at the delivery time to devices and then average those figures to achieve a single score.)And when you , you realize all that's happened over these last couple years is that Samsung has returned to the level of mediocrity it was achieving six years ago, with 2014's . The company had a rough run of horrifically bad years after that — so, yes, it  been doing better than those really rough years as of late. And it  been servicing more phones than ever and actually getting updates out to even its non-flagship phones within this initial six-month period. That's certainly something.But you can't grade a company only relative to its own past letdowns and the low bar it's established for itself. And the number of different phone models Samsung has to juggle shouldn't be a factor for , as people who pay for and use the devices. Again, regardless of any circumstances within the company you're purchasing a phone from, all that ultimately matters is the experience that , as the customer, receive.And on that note, as usual, Samsung has made no effort whatsoever to communicate with its customers about its upgrade process or what can be expected along the way in this Android upgrade cycle.I've said it before, and I'll say it again: Samsung can — and should — do better. Particularly for a company of its size and with its immense financial and engineering-related resources, delivering updates to people three to five months late (even now, with the benefits of Google's recent  Android upgrade processing improvements ) comes down to one thing and one thing only: .After a solid three-year streak of holding the second-place spot and steadily increasing its performance with Android upgrades, OnePlus has fallen hard with its Android 11 rollout. The company actually did pretty well with its current flagship phones, the OnePlus 8 and 8 Pro, but it completely dropped the ball with its -gen flagship — the OnePlus 7T, which  hasn't gotten the update as of this writing — and that was enough to bring down its score considerably.Also not helping is the fact that OnePlus never does a heck of a lot in terms of communication with customers about its progress. The first official peep from the company came , when it posted a message in its forums noting that it had run into a \"data decryption issue\" with the OnePlus 7T phone and consequently was running later than it had anticipated with that device's Android 11 delivery. That four-months-late acknowledgment is better than nothing, of course — and it's the reason the company got a five-point communication score instead of a flat zero — but it isn't even close to enough.I can only hope that this stumble was a genuine fluke and that OnePlus will get back on track with Android 12 later this year. After seeing the company go from a 65% D score with Android 8 to a 74% C with Android 9 and then a pretty-darn-good with Android 10, it'd be a real shame to see subpar scores become its norm again.", "link": "https://www.computerworld.com/article/3606708/android-11-upgrade-report-card.html"},
{"title": "Android 12 and the big deal with little touches", "img_url": "https://images.idgesg.net/images/article/2021/02/android-12-100878591-large.jpg", "content": "Ahh — can you smell it? The scent of freshly baking Android software is very much in the air this week, as Android 12's first official developer preview teases us with a tiny taste of what's to come.Google  the inaugural public version of Android 12 last week, and the internet's many software-sniffing sleuths have been hard at work pokin' around and clawing at its many crevices to uncover every last hint of the treats lurking within.So far, Android 12 doesn't look like much — and for good reason: This latest  really is a true , with mostly just technical changes aimed at, y'know, developers. It actually makes an awful lot of sense, even if Android previews in the past have generally been  early on.But don't despair. Despite the limited number of new front-facing features in the current version of the software, the combination of tucked-away bits of code in its corners and prerelease leaks surrounding the preview gives us a pretty interesting picture of some of the flavors Android 12 might end up serving.It's creating a pretty unusual situation, too, as it's forcing us to focus mostly on those relatively little touches — the sorts of small but significant enhancements that often get lost in the bigger-picture view of a new Android release. And lemme tell ya: If everything we're seeing now ends up making it into the final Android 12 software this fall, we could have some  helpful new tools at our fingertips.Here's one example: Signs suggest Android 12 will include a new  — something that  has me geeking out over the subtle but significant quality-of-life improvement it could provide. The system would apparently use your phone's front-facing camera to continuously detect which way your head is turned, relative to your phone, and then automatically adjust your screen's rotation in the way that makes the most sense for any given moment.Small detail? You betcha. But massively significant in terms of real-world value? You'd better believe it. As we discussed in , it's such an intelligent and Googley solution to a constant, always-appearing pain point of modern-day phone use — one of those little irksome things that annoys most of us numerous times every day — and it's a perfect example of how software and ongoing updates can play such an important role in the phone-owning experience, even when the effect is subtle.Another possible Android 12 improvement I'm excited to see is a series of improvements the gumshoes over at  with the software's oft-overlooked picture-in-picture system — y'know, the thing that shrinks YouTube videos, Maps navigations, and other such materials down into a small floating window that can be moved around on top of whatever else you're doing. Android 11 made it possible  by dragging your finger diagonally on their edges, and now, it looks like Android 12 could take things a step further by (a) making it even easier to resize 'em, with proper pinch-to-zoom support, and (b) letting you push a picture-in-picture window off the side of your screen to get it out of your way temporarily without having to dismiss it entirely.Again: Tiny improvements, right? Almost not even worthy of a mention in any official Android 12 announcement? Yuuuup. And, for that matter, let's be honest: Once we see the big picture of Android 12, there's very little chance that changes like this  get any attention. But as someone who uses that picture-in-picture function constantly for keeping an eye on videos whilst I go about other Very Important Work-Related Tasks (since those are the only tasks I ever tackle, obviously), I can't even begin to express how much easier it'd make my life to have those options.The same can be said for the  piddly-sounding addition of a new swipe gesture for Android's screenshot confirmation function. Google recently started showing an on-screen confirmation every time you capture a screenshot on your phone — a pint-sized preview of the image along with an option to share or edit it. And vexingly, you have to tap a tiny \"x\" on that confirmation in order to dismiss it. It's the smallest of small details, but the natural inclination when something like that pops up on your screen is to swipe it away — and as it stands now, doing that accomplishes little more than exercising your thumb for no reason and making you feel like a nit.Well, with Android 12, you can swipe that screenshot confirmation away. A small detail, absolutely, but one that'll make interactions with my phone easier, more efficient, and more effective countless times a day.The list goes on and on from there. Android 12 appears to have a more prominent command for notification snoozing — something I  (or so I tell myself) in 2017's  but that's remained awkwardly out of sight and thus mostly undiscovered by the masses — along with a simple new system-wide swipe-down-from-anywhere gesture for easily opening your notification panel and other one-handed phone use enhancements.The software seems to include some super-sensible improvements to the core , too — three cheers for ! — as well as an improvement to the Android magnification tool that'll make that feature  easier to use for anyone with accessibility needs. And all of this is still only scratching the surface.From what we know so far, it seems like the bigger themes of Android 12 could revolve around security, with a new set of controls for restricting how and when apps can access your microphone and camera (and a hefty set of  alongside that); design, with some significant-looking changes to the Android visual language and an ambitious new system for native theming throughout all of Android; and widgets, with a renewed focus that could fulfill my high-geek-quotient fantasies of both  and a .That's all well and good, but with the exception of maybe that last item, I'm honestly more excited about the little stuff. Once the launch-week coverage fades away and the software makes its way into our sweaty person-paws, it's often those smaller touches that make the more tangible differences in our day-to-day lives. And as we've seen with our recent explorations of  from the past, it's all too easy to overlook those sorts of things and fail to appreciate what they have to offer.With Android 12, we're in the unusual position of being able to focus our attention solely on those smaller elements, at least for this fleeting moment. And that, at this point in the process, might just be the greatest gift of all.", "link": "https://www.computerworld.com/article/3608956/android-12-little-touches.html"},
{"title": "When Windows bug fixes go bad, IT can now roll back individual changes", "img_url": "https://images.idgesg.net/images/article/2020/08/hand_flicks_on_update_switch_software_update_fix_patch_by_stadtratte_gettyimages-1140137377_2400x1600-100854510-large.jpg", "content": "Microsoft this week announced a new enterprise-only flexibility in Windows servicing that lets IT professionals roll back individual non-security elements of an update when a change breaks something.The feature, dubbed \"Known Issue Rollback,\" aka , is an unusually frank admission that the company's nearly six-year-long experiment of forcing customers to either accept everything in an update or pass on the update entirely, is flawed.\"Even as quality has improved over the last five years, we do acknowledge that sometimes things can and do go wrong,\" Namrata Bachwani, principal program manager lead, said in a  from Microsoft's all-virtual . \u2028\u2028\"In the past, you had two choices: all or nothing,\" Bachwani continued. \"You either take it all, so you install the update and you get all the great fixes that you want  the problem, which is causing an issue for your customers. Or you take nothing.\"So you either don't install the update because you've heard that it causes a problem, or you uninstall it, which means the problem goes away but you also don't get all the other great fixes in that package, which has changes that you want and need,\" she said. \u2028If Bachwani's summary sounds familiar, it should: Essentially, it was the argument made by critics of Windows 10's practice of bundling fixes, both security and non-security, into one package that was not only cumulative — it included all prior fixes as well as the newest — but was indivisible. to previous editions of the OS, which had offered each fix as a separate, discrete update that could be deployed ... or not.Customers, including enterprise IT personnel, could — as Bachwani pointed out — either forgo an update because of a known (or suspected) problem  accept the update, even though it contained one or more flaws. The dilemma caused many to decry Microsoft's take-it-or-leave-it attitude, which . In the end, customers did what they almost always did in the face of a Microsoft move; they accepted it, since they had little recourse.But apparently  kept complaining,  Microsoft listened to.\"We have been listening to you and working on how to handle such a scenario in a targeted, nondestructive way,\" Bachwani said.KIR was functional as of Windows 10 2004 (also known as  after another Microsoft name change for Windows 10's feature upgrades), with about 80% of the changes in that version capable of rollback. But some past versions — Microsoft explicitly mentioned 1809 and 1909 — partially support the feature.Because Windows 10 Enterprise customers receive 30 months of support for the year's second-half upgrade, it's most likely that they'll first encounter KIR with Windows 10 20H2 and, if not then, with this year's 21H2, due out in the fall. (KIR also boosts the case for enterprises moving to 20H2 with all due speed.)As Microsoft's software engineers tackle a non-security bug, they write the fix but, unlike in the past, retain the old code impacted by the changes. , principal program manager lead, those changes are \"contained\" using KIR capability. When the update is released and users deploy it, each KIR-enabled fix runs normally.But if the OS encounters a specific group policy, the code in the change \"container\" is ignored and the original code — the part retained by the engineer when she wrote the fix — runs instead. Each individual fix is assigned a different group policy. \"If a fix turns out to have a serious problem, Azure-hosted services and Windows work in tandem to update this policy-setting on the device and disable the problematic fix,\" wrote Vernon.There are two ways KIR can be triggered to roll back a bad update.For consumers and small businesses, Microsoft itself manages KIR. \"We make a configuration change in the cloud,\" said Vernon, referring to the action the Redmond, Wash. company would take once it's decided to roll back a bug fix issued by a recent update. \"Devices connected to Windows Update or Windows Update for Business are notified of this change and it takes effect with the next reboot.\"In this scenario, users would be unaware that Microsoft had kicked in KIR. Microsoft would know, however, because users' PCs would tell the firm, via Windows' telemetry, which code — the new, but buggy fix, or the old, hopefully stable code — to use. \"This data helps us learn how well the rollback is succeeding in the ecosystem,\" said Vernon.For managed machines, KIR will be under control of the IT staff. Microsoft will publish information about the known issue in the update's documenting bulletin, the , under the \"mitigations\" section, along with a link to Microsoft's Download Center, where the appropriate Group Policy will be posted. IT personnel would then deploy the policy to the organization's PCs using the usual tools.Microsoft made a point to stress that IT will be in charge of KIR on their managed systems. \"In the KB article, we describe the issue and related information that would help IT pros make informed choices,\" said Vatsan Madhavan, principal software engineer, in an .Normally, the KIR Group Policies don't need to be retracted or removed by the IT staff, Madhavan said, because they're only valid for that KIR — and once the known issue has been addressed, they become moot. \"Once the underlying problem has been fixed, the Group Policy has outlived its usefulness. It becomes a benign setting and can be undeployed safely,\" Vernon wrote in the March 2 blog post.Microsoft has further work on KIR already outlined, including integrating it with Intune, the cloud-based mobile device management platform, so that organizations that no longer use Group Policy will be able to leverage the functionality.", "link": "https://www.computerworld.com/article/3610413/when-windows-bug-fixes-go-bad-it-can-now-roll-back-individual-changes.html"},
{"title": "Noteworthy technology acquisitions 2021", "img_url": "https://images.idgesg.net/images/article/2019/05/jigsaw_puzzle_pieces_coming_together_mergers_acquisitions_problem-solving_by_metamorworks_gettyimages-916449208_3x2_2400x1600-100796552-large.jpg", "content": "Amid the coronavirus, 2020 was unpredictable in more ways than anyone would have expected. But one thing that stayed fairly constant was the steady flow of mergers and acquisitions (M&A) across the tech sector.Global tech M&A deals last year totalled $634 billion, a 91.8% year-over-year increase, according to . Among a late flurry of big deals was the $35 billion acquisition of Xilinx by Advanced Micro Devices and Salesforce's $27.7 billion acquisition of Slack.As for whether 2021 will maintain last year’s pace, if the first part of the year is anything to go by, there will be no slowing of big deals across the industry, with silicon innovations and collaboration software already proving to be hot areas.Here are the biggest enterprise technology acquisitions of 2021 so far, in reverse chronological order:Okta  for $6.5 billion in an all-stock deal. That price represents a significant premium, as Auth0 was last valued at $1.92 billion privately after raising $120 million in July 2020; that investment was led by Salesforce Ventures.At first glance, the acquisition looks highly complementary, as Okta builds SaaS tools to help organizations identify and authenticate access to applications across their business. Auth0 was established in 2013 by a team of ex-Microsoft engineers, intent on building a developer-friendly way to include identity management controls within applications.Okta confirmed that Auth0 will continue to operate as an independent business unit, but Okta will look for  integration opportunities once the deal has been rubber stamped.“Combining Auth0’s developer-centric identity solution with the Okta Identity Cloud will drive tremendous value for both current and future customers,” Okta CEO Todd McKinnon said in a statement. “Okta’s and Auth0’s shared vision for the identity market, rooted in customer success, will accelerate our innovation, opening up new ways for our customers to leverage identity to meet their business needs. We are thrilled to join forces with the Auth0 team, as they are ideal allies in building identity for the internet and establishing identity as a primary cloud.”Atlassian announced that it's  for an undisclosed amount. The Australian software-as-a-service company will look to incorporate Chartio’s collaborative dashboards and reports into its own analytics tools and to give users of tools like Jira and Confluence better insight into their data.“Atlassian products are home to a treasure trove of data, and our goal is to unleash the power of this data so our customers can go beyond out-of-the-box reports and truly customize analytics to meet the needs of their organization,” Zoe Ghani, head of product experience at platform at Atlassian, .It's bad news for existing Chartio customers however, who have been .The UK media landscape shifted in February when the media monitoring and PR database Cision , the online consumer intelligence and social media listening platform, for $450 million in a combined cash and stock deal.Based in Brighton on the English south coast, Brandwatch specializes in social listening that allows brands to get a better idea of consumer sentiment. Cision hopes to bring this together with its media and PR smarts to give clients a fuller picture of how consumers view their brand.“The continued digital shift and widespread adoption of social media is rapidly and fundamentally changing how brands and organizations engage with their customers. This is driving the imperative that PR, marketing, social, and customer care teams fully incorporate the unique insights now available into consumer-led strategies,” Cision CEO Abel Clark said in a statement.Autodesk  for $1 billion in February. The Portland, OR-based Innovyze makes software to model, simulate and analyze water infrastructure.Autodesk specializes in industrial CAD software for 3D modelling and is popular with architects and engineers. This acquisition is aimed at giving the company a foothold in the water utilities market.“Autodesk’s design DNA is found in just about every structure you see above ground and below, so it makes strategic sense to bring together our complementary organizations critical to much of the world’s population,\" Colby Manwaring, CEO of Innovyze, said in a statement. \"We look forward to completing the acquisition and getting to work, together.\"Hot on the heels of the SentinelOne acquisition of Scalyr, CrowdStrike , for $400 million. Humio’s unique selling point has always been unlimited logging, allowing customers to collect as much as they want for a .“Humio had become the data lake for these enterprises, enabling searches for longer periods of time and from more data sources allowing them to understand their entire environment, prepare for the unknown, proactively prevent issues, recover quickly from incidents, and get to the root cause,” Geeta Schmidt, Humio CEO .CrowdStrike is looking to add this logging capability to its security monitoring tools to help customers react to threats in closer to real time.“The combination of real-time analytics and smart filtering built into CrowdStrike’s proprietary Threat Graph and Humio’s blazing-fast log management and index-free data ingestion dramatically accelerates our capabilities beyond anything the market has seen to date,” CrowdStrike CEO and co-founder George Kurtz said in a statement.Cybersecurity analytics vendor SentinelOne made a , picking up the log analytics and  for $155 million in stock and cash.The combination of Scalyr’s data analytics with our industry leading AI capabilities ushers in a new era of machine-speed prevention, detection, and response to attacks across the enterprise,” Tomer Weingarten, CEO of SentinelOne, said in a statement.Still a startup, although a well-funded one with a $3 billion private valuation, SentinelOne expects to integrate Scalyr’s high-speed logging capabilities into its own software for faster threat intelligence, while also continuing to run it as a standalone product with a loyal set of current customers.HR and finance software specialist Workday  for $700 million in cash.Founded in Denmark in 2014, Peakon had raised $68 million in funding to date. It offers organizations a software-as-a-service (SaaS) tool for regularly tracking employee sentiment and other tools to measure the happiness of the workforce, making it a highly complementary acquisition for Workday’s own SaaS HR tools.“Bringing Peakon into the Workday family will be very compelling to our customers – especially following an extraordinary past year that has magnified the importance of having a constant pulse on employee sentiment in order to keep people engaged and productive,” Aneel Bhusri, cofounder and co-CEO of Workday said in a statement.German software firm SAP , which specializes in cloud-native enterprise business process intelligence and management for an undisclosed fee.  after a $177 million funding round in July 2019.The announcement was made in conjunction with a new product from SAP called , a bundle of existing SAP software and services aimed at offering customers “business transformation-as-a-service”.SAP will aim to use Signavio’s expertise around business process intelligence to help more customers optimize these processes as they become more digital.“I cannot overstress the importance for companies to be able to design, benchmark, improve, and transform business processes across the enterprise to support new capabilities and business models,” Luka Mucic, chief financial officer and member of SAP's Executive Board, .Virtualization specialist Citrix announced the planned acquisition of collaboration software maker  for $2.25 billion in cash. Citrix already has a digital work platform called Workspace and will look to fold the Wrike team and technology into that product.\"Together, Citrix and Wrike will deliver the solutions needed to power a cloud-delivered digital workspace experience that enables teams to securely access the resources and tools they need to collaborate and get work done in the most efficient and effective way possible across any channel, device or location,\" David Henshall, president and CEO of Citrix, .Cisco started the year by  for $4.5 billion. Originally announced in July 2019, there was a lot of back and forth over the deal, with Cisco paying an additional $1.9 billion to get the purchase over the line.Based in Massachusetts, Acacia specializes in high-speed optical systems such as  digital signal processing, photonic integrated circuit modules, and transceivers for use in networking products and data centers — a set of technologies Cisco clearly sees as integral to future networks linking data centers, cloud, and service providers.\"Together we will ignite our strategy to transform the optical world as we know it, with innovative solutions to boost network capacity inside and outside the data center,\" Bill Gartner, senior vice president and general manager, Cisco Optical Systems and Optics Group, .Acacia CEO Raj Shanmugaraj and company employees will join Cisco's Optics business upon completion of the deal.Hot on the heels of a burst of semiconductor consolidation at the end of 2020, Qualcomm  for around $1.4 billion.The two-year-old Santa Clara-based company was founded by a team of Apple engineers and makes high-performance CPU chips. “The Nuvia team are proven innovators, and like Qualcomm, have a strong heritage in creating leading technology and products…. Together, we are very well positioned to redefine computing and enable our ecosystem of partners to drive innovation and deliver a new class of products and experiences for the 5G era,\" Cristiano Amon, president and CEO-elect at Qualcomm said in a statement.", "link": "https://www.computerworld.com/article/3605102/noteworthy-technology-acquisitions-2021.html"},
{"title": "US IT jobs growth continues, but at a slower pace, in February", "img_url": "https://images.idgesg.net/images/article/2018/10/now-hiring_board_c-suite_fired_terminated_layoff_job-role-100777485-large.jpg", "content": "As the overall US economy showed continued glimpses of recovery in February, the IT job market continued the rebound that began in the fall, though at a slower pace than in January.Growth last month was 13,700, according to the . January saw 8,600 new IT jobs. When adjusted for seasonality, February saw 6,000 new IT jobs, and January saw 10,900, down dramatically from the US Bureau of Labor Statistics’ (BLS') original estimate of 18,200.Still, the overall trend for IT — whose US jobs number 3.6 million — remains on an upward trajectory.The Janco figures jibe with a report released by the CompTIA industry association. It calculated that there were 7,700 new US tech sector jobs in February, following a gain of 19,500 in January. CompTIA calculates both technical and  nontechnical positions at tech vendors, whereas Janco looks at IT positions, including software developers, in all industries.Using a much broader definition of IT, including sales positions, CompTIA estimated that 178,000 IT-related jobs were added in February across all industries, following a 78,000-job gain in January. That reflects an unemployment rate of 2.4%, down from 3.0% in December 2020.Nationally, for all jobs, the US unemployment rate fell from an adjusted 6.3% in January to 6.2% in February, . But the national unemployment rate is closer to 9% if those who have given up looking are included, ; the BLS reports the level of these discouraged workers has remained steady.CompTIA also saw the number of IT-related job listings grow by about 44,300 in February, passing 277,000. That follows a rise of 26,000 listings in January. Software developers constituted the largest pool of listed openings at 88,000, with listings for systems engineers and architects coming in second at 22,700. But Janco CEO M. Victor Janulaitis expects that over the next several years, coders will find jobs scarcer as gains traction, even as demand for software developers overall increases.", "link": "https://www.computerworld.com/article/3542681/us-it-jobs-growth-continues-but-at-a-slower-pace-in-february.html"}
]